INSERT INTO Metrolog values
(1,'Jure','Bajc','2022-03-22'),
(2,'Sergej','Bergant','2022-03-22'),
(3,'Miha','Novak','2012-03-22'),
(4,'Nejc','Bolak','2014-03-22'),
(5,'Drejc','Bone','2015-03-22'),
(6,'Dani','Putin','2015-03-22'),
(7,'Juri','Macron','2015-03-22'),
(8,'Tomi','Trump','2015-03-22'),
(9,'Tome','Janša','2017-03-22'),
(10,'Božidar','Plaša','2017-03-22'),
(11,'Bine','Govni','2018-03-22'),
(12,'Mine','Bolni','2019-03-22'),
(13,'Sara','Dugi','2021-03-22'),
(14,'Katja','Nusdorfer','2001-03-22'),
(15,'Žiga','Premrl','2002-03-22'),
(16,'Jernej','Umrl','2002-03-22'),
(17,'Jurij','Zaki','2007-03-22'),
(18,'Vladimir','Vlaki','2021-03-22'),
(19,'Toni','Božic','2012-03-22'),
(20,'Boni','Blažič','2021-03-22');

insert into Merilna_Naprava(ID_NAPR,Ime,Zemljepisna_sirina,Zemljepisna_dolzina)Values
(1,'Maribor 1',46.1231,15.23412),
(2,'Koper 1',46.1231,15.543),
(3,'Celje 1',46.234,15.12457653123),
(4,'Maribor 12',46.1234,15.5467),
(5,'Lendava 1',42.1231,15.123562),
(6,'Ajdovščina 1',6.1231,15.45623),
(7,'Ljubljana 1',44.1231,15.2345),
(8,'Koper 12',44.1231,15.432),
(9,'Novo mesto1',46.1231,15.1234),
(10,'Nova Gorica 1',46.1231,15.123),
(11,'Gorica 1',45.1231,15.567),
(12,'Trst 1',42.1231,15.734565),
(13,'Dobravlje 1',42.1231,15.21),
(14,'Logatec 1',44.1231,15.34),
(15,'Žablje 1',47.1231,15.8765),
(16,'Male žablje 1',48.1231,15.4567),
(17,'Laško 1',49.1231,15.561),
(18,'Cesta 1',49.1231,15.2341),
(19,'Alpe 1',40.1231,15.3125),
(20,'Triglav 1',1.1231,15.5123);

alter table Meritve modify column Okvara char(2);

insert into Meritve values
(1,'2021-03-22',20,50,'NE',11,1),
(2,'2021-03-22',22,50,'NE',12,2),
(3,'2021-03-22',23,50,'DA',13,3),
(4,'2021-03-22',24,50,'NE',14,4),
(5,'2021-03-22',25,50,'NE',15,5),
(6,'2021-03-22',26,50,'DA',16,6),
(7,'2021-03-22',27,50,'NE',17,7),
(8,'2021-03-22',20,50,'NE',18,8),
(9,'2021-03-22',2,50,'NE',19,9),
(10,'2021-03-22',0,0,'NE',20,10),
(11,'2021-03-22',230,50,'NE',1,11),
(12,'2021-03-22',40,50,'NE',2,12),
(13,'2021-03-22',20,50,'DA',3,13),
(14,'2021-03-22',20,50,'NE',4,14),
(15,'2021-03-22',20,50,'NE',5,15),
(16,'2021-03-22',20,50,'NE',6,16),
(17,'2021-03-22',20,50,'DA',7,17),
(18,'2021-03-22',20,50,'NE',8,18),
(19,'2021-03-22',20,50,'NE',9,19),
(20,'2021-03-22',20,50,'NE',10,20),
(21,'2021-03-22',20,50,'NE',11,11),
(22,'2021-03-22',20,50,'DA',12,12),
(23,'2021-03-22',20,50,'NE',13,13),
(24,'2021-03-22',20,50,'NE',14,14),
(25,'2021-03-22',20,50,'NE',15,15),
(26,'2021-03-22',20,50,'NE',16,16),
(27,'2021-03-22',20,50,'NE',17,17),
(28,'2021-03-22',20,50,'DA',18,18),
(29,'2021-03-22',20,50,'NE',19,19),
(30,'2021-03-22',20,50,'NE',2,20),
(31,'2021-03-22',20,50,'DA',3,2),
(32,'2021-03-22',20,50,'NE',4,3),
(33,'2021-03-22',20,50,'NE',5,3),
(34,'2021-03-22',20,50,'NE',6,4),
(35,'2021-03-22',20,50,'DA',7,5),
(36,'2021-03-22',20,50,'NE',8,6),
(37,'2021-03-22',20,50,'NE',9,7),
(38,'2021-03-22',20,50,'DA',10,7),
(39,'2021-03-22',20,50,'NE',1,9),
(40,'2021-03-22',20,50,'NE',1,8);

update Merilna_Naprava SET zemljepisna_sirina =46.562483 where (zemljepisna_sirina IS NOT NULL AND ID_NAPR >=0);

UPDATE Metrolog SET Ime = 'Jure', Priimek= 'Bajc', Datum_Zaposlitve = '2001-1-1'where ID_MLOG<>0;

alter table Meritve drop constraint FK_ID_NAPR_TK;
alter table Meritve drop foreign key Meritve_ibfk_1;

DELETE from Metrolog where ID_MLOG<>0;
DELETE from Merilna_Naprava where ID_NAPR<>0;

update Metrolog set Ime ='Nejc' where ime ='Jure'and ID_MLOG<>0;

delete from Metrolog where ime ='Jure'and ID_MLOG<>0;


select * from Metrolog;
SELECT* FROM Meritve;
select * from Merilna_Naprava;